In [2]:
import pandas as pd

In [ ]:
df_iris = pd.read_json('../data/iris.json')
df_iris.describe()

       sepalLength  sepalWidth  petalLength  petalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.057333     3.758000    1.199333
std       0.828066    0.435866     1.765298    0.762238
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [15]:
df_titanic = pd.read_excel('../data/titanic.xlsx')
df_min = df_titanic['Age'].min()
df_max = df_titanic['Age'].max()
df_sum = df_titanic['Age'].sum()
print(df_min, df_max, df_sum)

0.42 80.0 21205.17

In [14]:
df_movie = pd.read_csv('../data/movie.csv')
a = df_movie['duration'].max()
a

np.float64(511.0)

In [16]:
df = df_movie
top_director = df.groupby("director_name")["director_facebook_likes"].sum().idxmax()
top_director_likes = df.groupby("director_name")["director_facebook_likes"].sum().max()
top_5_longest_movies = df.nlargest(5, "duration")[["movie_title", "director_name", "duration"]]

print(top_director)
print(top_director_likes)
print(top_5_longest_movies)

Steven Spielberg
364000.0
                   movie_title        director_name  duration
1694                   Trapped                  NaN     511.0
2436                    Carlos                  NaN     334.0
1487       Blood In, Blood Out      Taylor Hackford     330.0
1134             Heaven's Gate       Michael Cimino     325.0
3254  The Legend of Suriyothai  Chatrichalerm Yukol     300.0

In [3]:
df_parquet = pd.read_parquet('../data/flights')
fill_mean = df_parquet.select_dtypes('number').fillna(df_parquet.select_dtypes('number').mean())
fill_mean

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[6729125 rows x 0 columns]